Config/InformationRegisters/АльтернативныеИдентификаторыПолучателейГосуслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АльтернативныеИдентификаторыПолучателейГосуслуг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АльтернативныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАльтернативногоИдентификатора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАльтернативныхИдентификаторовПолучателейГосуслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ГражданствоФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГражданствоФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/АльтернативныеИдентификаторыПолучателейГосуслуг/Forms/ФормаФормированияАльтернативногоИдентификатора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимФормирования = "2.0";
	КодФК = "";
	
	Если ЗначениеЗаполнено(Параметры.ИспользуемыйИдентификатор) Тогда
		
		Если СтрДлина(Параметры.ИспользуемыйИдентификатор) = 25 Тогда
			Идентификатор = Сред(Параметры.ИспользуемыйИдентификатор,3,20);
			КодСтраны = Сред(Параметры.ИспользуемыйИдентификатор,23,3);
			Если ЗначениеЗаполнено(КодСтраны) Тогда
				Страна = Справочники.СтраныМира.НайтиПоКоду(КодСтраны);
			КонецЕсли;
			КодФК = Сред(Параметры.ИспользуемыйИдентификатор,1,2);
			
			РежимФормирования = "1.16";
		ИначеЕсли СтрДлина(Параметры.ИспользуемыйИдентификатор) = 22 Тогда
			Идентификатор = Сред(Параметры.ИспользуемыйИдентификатор,4,19);
			
			КодФК = Сред(Параметры.ИспользуемыйИдентификатор,2,2);
			
			РежимФормирования = "2.0";
		КонецЕсли;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КодФК)
		И ЗначениеЗаполнено(Параметры.ВидАльт) Тогда
		КодФК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ВидАльт,"Префикс");
	КонецЕсли;
		
	Если ЗначениеЗаполнено(КодФК) Тогда
		ВидДок = КодФК;
	КонецЕсли;
	
	Если РежимФормирования = "1.16" 
		И НЕ ЗначениеЗаполнено(Страна) 
		И ЗначениеЗаполнено(Параметры.ФизЛицо) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ГражданствоФизическихЛицСрезПоследних.Страна
			|ИЗ
			|	РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(, ФизическоеЛицо = &ФизЛицо) КАК ГражданствоФизическихЛицСрезПоследних";

		Запрос.УстановитьПараметр("ФизЛицо", Параметры.ФизЛицо);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Страна = ВыборкаДетальныеЗаписи.Страна;
		Иначе
			Страна = Справочники.СтраныМира.Россия;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ГруппаСтрана.Видимость = (РежимФормирования = "1.16");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимФормированияПриИзменении(Элемент)
	Если РежимФормирования = "2.0" Тогда
		Элементы.ГруппаСтрана.Видимость = Ложь;
	Иначе
		Элементы.ГруппаСтрана.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	ЗначениеИдн = СокрЛП(Идентификатор);
	ДлинаИдн = СтрДлина(ЗначениеИдн);  
	
	Диапазоны = Новый Массив;
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 48, 57)); 		// цифры
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 65, 90)); 		// латиница большие
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 97, 122)); 		// латиница маленькие
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1040, 1103)); 	// кириллица
	КонечныйИдн = "";
	Для Идн = 1 По ДлинаИдн Цикл
		Символ = Сред(ЗначениеИдн,Идн,1);
		КодСимвола = КодСимвола(Символ);
		Для Каждого Диапазон Из Диапазоны Цикл
			Если КодСимвола >= Диапазон.Мин И КодСимвола <= Диапазон.Макс Тогда
				КонечныйИдн = КонечныйИдн + Символ;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Если РежимФормирования = "1.16" Тогда
		КонечныйИдн = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(КонечныйИдн,20,0,"Слева");
		КонечныйИдн = Прав(КонечныйИдн,20);
		Результат = ВидДок + КонечныйИдн + Элементы.СтранаКод.ТекстРедактирования;
	Иначе
		КонечныйИдн = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(КонечныйИдн,19,0,"Слева");
		КонечныйИдн = Прав(КонечныйИдн,19);
		Результат = "1"+ВидДок + КонечныйИдн;
	КонецЕсли;
	Закрыть(Результат);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
